Revit 2024 API
View3D.Unlock Method
 Unlocks the view. Has no effect if the view is already unlocked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void Unlock()
Visual Basic
Public Sub Unlock
Visual C++
public:
void Unlock()
See Also
View3D Class
Autodesk.Revit.DB Namespace